//5
//Массивы (Руководство по программированию на C#) описывает масивы и их свойства
//Array Класс описывает методы создания, изменения, поиска и сортировки массивов,примеры и свойства аrray класса
//params (справочник по C#) в этой статье описуеться функция params
//Массивы массивов (Руководство по программированию на C#) описует массивы массивов и пример их использования
//.NET Framework - статья содержит большое количество информации о.NET Framework
//Обзор среды CLR  среда выполнения ( CLR), которая выполняет код и предлагает службы, облегчающие процесс разработки.
//Common Language Runtime в этой статье рассказывается про Common Language Runtime а именно про исполняющую среду для байт-кода и про её механизм кода
//JIT-компиляция  технология увеличения производительности программных систем, использующих байт-код, путём компиляции байт-кода в машинный код или в другой формат непосредственно во время работы программы.
//.NET это модульная платформа для разработки программного обеспечения с открытым исходным кодом
//Base Class Library описывает стандартую бибилиотеку .NET Framework